sergz72/ARM/mspm0g350x/ti/driverlib/dl_dac12.h
    /*! The bit resolution. One of @ref DL_DAC12_RESOLUTION */
    DL_DAC12_RESOLUTION resolution;

    /*! The input data representation. One of @ref DL_DAC12_REPRESENTATION */
    DL_DAC12_REPRESENTATION representation;

    /*! The voltage reference. One of @ref DL_DAC12_VREF_SOURCE */
    DL_DAC12_VREF_SOURCE voltageReferenceSource;

    /*! Output amplifier setting. One of @ref DL_DAC12_AMP */
    DL_DAC12_AMP amplifierSetting;

    /*! The FIFO enable. One of @ref DL_DAC12_FIFO */
    DL_DAC12_FIFO fifoEnable;

    /*! The Read Fifo Trigger source. One of @ref DL_DAC12_FIFO_TRIGGER */
    DL_DAC12_FIFO_TRIGGER fifoTriggerSource;

    /*! The bit to enable a DMA trigger source to use the DMA instead of
     *  the CPU to input data.
     *  One of @ref DL_DAC12_DMA_TRIGGER
     */
    DL_DAC12_DMA_TRIGGER dmaTriggerEnable;

    /*! The FIFO Threshold at which the DMA Trigger is asserted.
     *  One of @ref DL_DAC12_FIFO_THRESHOLD
     */
    DL_DAC12_FIFO_THRESHOLD dmaTriggerThreshold;

    /*! Enables the sample time generator as the FIFO trigger.
     *  One of @ref DL_DAC12_SAMPLETIMER
     */
    DL_DAC12_SAMPLETIMER sampleTimeGeneratorEnable;

    /*! Rate of the sample time generator. One of @ref
     *  DL_DAC12_SAMPLES_PER_SECOND
     */
    DL_DAC12_SAMPLES_PER_SECOND sampleRate;
} DL_DAC12_Config;

/**
 *  @brief      Initialize the DAC module
 *
 *  Initializes all the common configurable options for the DAC module. Any
 *  other custom configuration can be done after this initialization.
 *  @post DAC is not enabled
 *
 *  @param[in]  dac12   Pointer to the register overlay for the peripheral
 *  @param[in]  config  Configuration for DAC12 peripheral
 */
void DL_DAC12_init(DAC12_Regs *dac12, DL_DAC12_Config *config);

/**
 * @brief Enables power on DAC12 module
 *
 * @param dac12        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_DAC12_enablePower(DAC12_Regs *dac12)
{
    dac12->GPRCM.PWREN =
        (DAC12_PWREN_KEY_UNLOCK_W | DAC12_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables power on dac12 module
 *
 * @param dac12        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_DAC12_disablePower(DAC12_Regs *dac12)
{
    dac12->GPRCM.PWREN =
        (DAC12_PWREN_KEY_UNLOCK_W | DAC12_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if  power on dac12 module
 *
 * @param dac12        Pointer to the register overlay for the peripheral
 *
 * @return true if power is enabled
 * @return false if power is disabled
 */
__STATIC_INLINE bool DL_DAC12_isPowerEnabled(DAC12_Regs *dac12)
{
    return ((dac12->GPRCM.PWREN & DAC12_PWREN_ENABLE_MASK) ==
            DAC12_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Resets dac12 peripheral
 *
 * @param dac12        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_DAC12_reset(DAC12_Regs *dac12)
{
    dac12->GPRCM.RSTCTL =
        (DAC12_RSTCTL_KEY_UNLOCK_W | DAC12_RSTCTL_RESETSTKYCLR_CLR |
            DAC12_RSTCTL_RESETASSERT_ASSERT);
}

/**
 * @brief Returns if dac12 peripheral was reset
 *
 * @param dac12        Pointer to the register overlay for the peripheral
 *
 * @return true if peripheral was reset
 * @return false if peripheral wasn't reset
 *
 */
__STATIC_INLINE bool DL_DAC12_isReset(DAC12_Regs *dac12)
{
    return ((dac12->GPRCM.STAT & DAC12_STAT_RESETSTKY_MASK) ==
            DAC12_STAT_RESETSTKY_RESET);
}

/**
 *  @brief      Enables the DAC module
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 */
__STATIC_INLINE void DL_DAC12_enable(DAC12_Regs *dac12)
{
    dac12->CTL0 |= DAC12_CTL0_ENABLE_SET;
}

/**
 *  @brief      Disables the DAC Module
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 */
__STATIC_INLINE void DL_DAC12_disable(DAC12_Regs *dac12)
{
    dac12->CTL0 &= ~DAC12_CTL0_ENABLE_MASK;
}

/**
 *  @brief      Checks the enable bit of the DAC
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @return     Whether the DAC module is enabled
 *
 *  @retval     true    Module enabled
 *  @retval     false   Module disabled
 */
__STATIC_INLINE bool DL_DAC12_isEnabled(DAC12_Regs *dac12)
{
    uint32_t t = (dac12->CTL0 & DAC12_CTL0_ENABLE_MASK);
    return (t == DAC12_CTL0_ENABLE_SET);
}

/**
 *  @brief      Sets all elements of the input data format at once
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *  @param[in]  rep      Data Representation. One of
 *                       @ref DL_DAC12_REPRESENTATION
 *  @param[in]  res      Data Resolution. One of @ref DL_DAC12_RESOLUTION
 */
__STATIC_INLINE void DL_DAC12_configDataFormat(
    DAC12_Regs *dac12, DL_DAC12_REPRESENTATION rep, DL_DAC12_RESOLUTION res)
{
    DL_Common_updateReg(&dac12->CTL0, ((uint32_t) rep | (uint32_t) res),
        DAC12_CTL0_RES_MASK | DAC12_CTL0_DFM_MASK);
}

/**
 *  @brief      Gets the currently configured amplifier setting
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @return     Currently configured amplifier setting
 *
 *  @retval     One of @ref DL_DAC12_AMP
 */
__STATIC_INLINE DL_DAC12_AMP DL_DAC12_getAmplifier(DAC12_Regs *dac12)
{
    uint32_t ampVal =
        (dac12->CTL1 & (DAC12_CTL1_AMPEN_MASK | DAC12_CTL1_AMPHIZ_MASK));

    return (DL_DAC12_AMP)(ampVal);
}

/**
 *  @brief      Sets the DAC and output amplifer setting
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *  @param[in]  ampVal   amplifier configuration value. One of @ref DL_DAC12_AMP
 */
__STATIC_INLINE void DL_DAC12_setAmplifier(
    DAC12_Regs *dac12, DL_DAC12_AMP ampVal)
{
    DL_Common_updateReg(&dac12->CTL1, (uint32_t) ampVal,
        (DAC12_CTL1_AMPEN_MASK | DAC12_CTL1_AMPHIZ_MASK));
}

/**
 *  @brief      Gets the currently configured reference voltage source
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @return     Currently configured reference voltage
 *
 *  @retval     Bitwise OR of @ref DL_DAC12_VREF_SOURCE
 */
__STATIC_INLINE DL_DAC12_VREF_SOURCE DL_DAC12_getReferenceVoltageSource(
    DAC12_Regs *dac12)
{
    uint32_t refsVal =
        (dac12->CTL1 & (DAC12_CTL1_REFSP_MASK | DAC12_CTL1_REFSN_MASK));

    return (DL_DAC12_VREF_SOURCE)(refsVal);
}

/**
 *  @brief      Set the reference voltage source of the DAC
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *  @param[in]  refsVal  reference voltage source. Bitwise OR of
 *                       @ref DL_DAC12_VREF_SOURCE
 */
__STATIC_INLINE void DL_DAC12_setReferenceVoltageSource(
    DAC12_Regs *dac12, DL_DAC12_VREF_SOURCE refsVal)
{
    DL_Common_updateReg(&dac12->CTL1, (uint32_t) refsVal,
        (DAC12_CTL1_REFSP_MASK | DAC12_CTL1_REFSN_MASK));
}

/**
 *  @brief      Enables the DAC output by connecting it to the OUT0 pin
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 */
__STATIC_INLINE void DL_DAC12_enableOutputPin(DAC12_Regs *dac12)
{
    dac12->CTL1 |= DAC12_CTL1_OPS_OUT0;
}

/**
 *  @brief      Disable the DAC output by disconnecting it from the OUT0 pin
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 */
__STATIC_INLINE void DL_DAC12_disableOutputPin(DAC12_Regs *dac12)
{
    dac12->CTL1 &= ~DAC12_CTL1_OPS_MASK;
}

/**
 *  @brief      Checks to see whether the output is connected
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @return     Status of output connection
 *
 *  @retval     true  Output is connected
 *  @retval     false Output is not connected
 */
__STATIC_INLINE bool DL_DAC12_isOutputPinEnabled(DAC12_Regs *dac12)
{
    return ((dac12->CTL1 & DAC12_CTL1_OPS_MASK) == DAC12_CTL1_OPS_OUT0);
}

/**
 *  @brief      Enables the FIFO module
 *
 *  Enables the FIFO and the FIFO hardware control state machine
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 */
__STATIC_INLINE void DL_DAC12_enableFIFO(DAC12_Regs *dac12)
{
    /* Insert value */
    dac12->CTL2 |= DAC12_CTL2_FIFOEN_SET;
}

/**
 *  @brief      Disables the FIFO
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @sa         DL_DAC12_enableFIFO
 */
__STATIC_INLINE void DL_DAC12_disableFIFO(DAC12_Regs *dac12)
{
    /* Clear out the bit */
    dac12->CTL2 &= ~DAC12_CTL2_FIFOEN_MASK;
}

/**
 *  @brief      Checks whether the FIFO is enabled
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @return     Current status of the FIFO
 *
 *  @retval     true    FIFO is enabled
 *  @retval     false   FIFO is not enabled
 */
__STATIC_INLINE bool DL_DAC12_isFIFOEnabled(DAC12_Regs *dac12)
{
    uint32_t t = (dac12->CTL2 & DAC12_CTL2_FIFOEN_MASK);
    return (t == DAC12_CTL2_FIFOEN_SET);
}

/**
 *  @brief      Gets the FIFO threshold
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @return     Currently configured FIFO Threshold
 *
 *  @retval     One of @ref DL_DAC12_FIFO_THRESHOLD
 *
 *  @sa         DL_DAC12_setFIFOThreshold
 */
__STATIC_INLINE DL_DAC12_FIFO_THRESHOLD DL_DAC12_getFIFOThreshold(
    DAC12_Regs *dac12)
{
    uint32_t fifoThreshold = (dac12->CTL2 & DAC12_CTL2_FIFOTH_MASK);

    return (DL_DAC12_FIFO_THRESHOLD)(fifoThreshold);
}

/**
 *  @brief      Sets the FIFO threshold
 *
 *  Determines the FIFO threshold In case of DMA based operation,
 *  DAC generates new DMA trigger when the number of empty locations in FIFO
 *  match the selected FIFO threshold level.
 *  In the case of CPU based operation, the FIFO threshold bits are don't care
 *  and FIFO level is directly indicated through the respective bits in the
 *  RIS register
 *
 *  @param[in]  dac12       pointer to the register overlay of the peripheral
 *  @param[in]  fifoThreshold  Threshold value. One of @ref DL_DAC12_FIFO_THRESHOLD
 */
__STATIC_INLINE void DL_DAC12_setFIFOThreshold(
    DAC12_Regs *dac12, DL_DAC12_FIFO_THRESHOLD fifoThreshold)
{
    DL_Common_updateReg(
        &dac12->CTL2, (uint32_t) fifoThreshold, DAC12_CTL2_FIFOTH_MASK);
}

/**
 *  @brief      Gets the FIFO read trigger source
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @return     Currently configured trigger source
 *
 *  @retval     One of @ref DL_DAC12_FIFO_TRIGGER
 *
 *  @sa         DL_DAC12_setFIFOTriggerSource
 */
__STATIC_INLINE DL_DAC12_FIFO_TRIGGER DL_DAC12_getFIFOTriggerSource(
    DAC12_Regs *dac12)
{
    uint32_t fifoTrig = (dac12->CTL2 & DAC12_CTL2_FIFOTRIGSEL_MASK);

    return (DL_DAC12_FIFO_TRIGGER)(fifoTrig);
}

/**
 *  @brief      Sets the FIFO read trigger source
 *
 *  Selects the source for FIFO read trigger by the DAC. When the selected FIFO
 *  read trigger is asserted, the data from FIFO (as indicated by read pointer)
 *  is moved into internal DAC data register
 *
 *  @param[in]  dac12       pointer to the register overlay of the peripheral
 *  @param[in]  fifoTrig    Read Trigger Source. One of
 *                          @ref DL_DAC12_FIFO_TRIGGER
 */
__STATIC_INLINE void DL_DAC12_setFIFOTriggerSource(
    DAC12_Regs *dac12, DL_DAC12_FIFO_TRIGGER fifoTrig)
{
    DL_Common_updateReg(
        &dac12->CTL2, (uint32_t) fifoTrig, DAC12_CTL2_FIFOTRIGSEL_MASK);
}

/**
 *  @brief      Enables the DMA trigger generator
 *
 *  When this is and the FIFO are enabled, the DMA trigger is generated based
 *  on the empty FIFO locations qualified by the selected FIFO Threshold
 *  settings. This bit is automatically cleared by hardware when the DMA done
 *  event is asserted with DMA status signal value being nonzero
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @sa         DL_DAC12_enableFIFO
 *  @sa         DL_DAC12_setFIFOThreshold
 */
__STATIC_INLINE void DL_DAC12_enableDMATrigger(DAC12_Regs *dac12)
{
    /* Insert value */
    dac12->CTL2 |= DAC12_CTL2_DMATRIGEN_SET;
}

/**
 *  @brief      Disables the DMA trigger generator
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @sa         DL_DAC12_enableDMATriggerGenerator
 */
__STATIC_INLINE void DL_DAC12_disableDMATrigger(DAC12_Regs *dac12)
{
    /* Clear out the bit */
    dac12->CTL2 &= ~DAC12_CTL2_DMATRIGEN_MASK;
}

/**
 *  @brief      Checks whether the DMA trigger generator is enabled
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @return     Current status of the DMA trigger generator
 *
 *  @retval     true   DMA Trigger enabled
 *  @retval     false  DMA Trigger not enabled
 */
__STATIC_INLINE bool DL_DAC12_isDMATriggerEnabled(DAC12_Regs *dac12)
{
    uint32_t t = (dac12->CTL2 & DAC12_CTL2_DMATRIGEN_MASK);
    return (t == DAC12_CTL2_DMATRIGEN_SET);
}

/**
 *  @brief      Enables the sample time generator
 *
 *  The sample time generator can be selected as the FIFO Trigger @ref
 *  DL_DAC12_setFIFOTriggerSource and control the rate at which the DAC will
 *  consume inputs from the FIFO
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 */
__STATIC_INLINE void DL_DAC12_enableSampleTimeGenerator(DAC12_Regs *dac12)
{
    /* Insert value */
    dac12->CTL3 |= DAC12_CTL3_STIMEN_SET;
}

/**
 *  @brief      Disables the sample time generator
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @sa         DL_DAC12_enableSampleTimeGenerator
 */
__STATIC_INLINE void DL_DAC12_disableSampleTimeGenerator(DAC12_Regs *dac12)
{
    /* Clear out the bit */
    dac12->CTL3 &= ~DAC12_CTL3_STIMEN_MASK;
}

/**
 *  @brief      Checks whether the sample time trigger generator is enabled
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @return     Current status of the sample time generator
 *
 *  @retval     true  Sample time generator is enabled
 *  @retval     false Sample time generator is not enabled
 */
__STATIC_INLINE bool DL_DAC12_isSampleTimeGeneratorEnabled(DAC12_Regs *dac12)
{
    uint32_t t = (dac12->CTL3 & DAC12_CTL3_STIMEN_MASK);
    return (t == DAC12_CTL3_STIMEN_SET);
}

/**
 *  @brief      Gets the sample trigger rate of the sample time generator
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @return     Currently configured sample rate
 *
 *  @retval     One of @ref DL_DAC12_SAMPLES_PER_SECOND
 */
__STATIC_INLINE DL_DAC12_SAMPLES_PER_SECOND DL_DAC12_getSampleRate(
    DAC12_Regs *dac12)
{
    uint32_t sampleRate = (dac12->CTL3 & DAC12_CTL3_STIMCONFIG_MASK);

